{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "batch_input_shape": [null, 100, 161, 1], "filters": 16, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "name": "conv2d_4", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 128, "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 64, "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 10, "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_3", "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_regularizer": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_5", "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_7"}}], "keras_version": "2.1.2"}