{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "conv2d_1", "filters": 16, "kernel_size": [3, 3], "dtype": "float32", "padding": "same", "bias_constraint": null, "batch_input_shape": [null, 100, 161, 1], "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "filters": 16, "kernel_size": [3, 3], "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_3", "filters": 32, "kernel_size": [3, 3], "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_4", "filters": 32, "kernel_size": [3, 3], "padding": "same", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 128, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 64, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "seed": null, "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 10, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_7"}}], "backend": "tensorflow", "keras_version": "2.1.2"}