{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "name": "conv2d_1", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "batch_input_shape": [null, 100, 161, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "name": "conv2d_2", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "name": "conv2d_3", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "name": "conv2d_4", "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_4"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 128, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 64, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "units": 15, "name": "dense_3"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "name": "batch_normalization_5"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_7"}}], "keras_version": "2.1.2"}